Tekla Open API Reference for Tekla Structures 2025
AnalysisDecomposedSelfweightLoad Class
 The AnalysisDecomposedSelfweightLoad class contains information of decomposed selfweight loads.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisObject
 Tekla.Structures.Analysis.AnalysisDecomposedLoad
 Tekla.Structures.Analysis.AnalysisDecomposedSelfweightLoad
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisDecomposedSelfweightLoad : AnalysisDecomposedLoad
Public NotInheritable Class AnalysisDecomposedSelfweightLoad
	Inherits AnalysisDecomposedLoad
The AnalysisDecomposedSelfweightLoad type exposes the following members.
Constructors
Name | Description
AnalysisDecomposedSelfweightLoad
Initializes a new instance of the AnalysisDecomposedSelfweightLoad class
Top
Properties
Name | Description
AnalysisLoadType
 Gets or sets the type of the analysis decomposed load.
 (Inherited from AnalysisDecomposedLoad.)
AnalysisModelName
 Gets or sets the analysis model name.
 (Inherited from AnalysisObject.)
AnalysisObjectType
 Gets or sets the type of the analysis object.
 (Inherited from AnalysisObject.)
Directions
 The directions of the decomposed selfweight load.
Factors
 The factors of the decomposed selfweight load.
FatherObject2ID
 Gets or sets the identifier of the father part.
 (Inherited from AnalysisObject.)
FatherObject2Type
 Gets or sets the type of the father object.
 (Inherited from AnalysisObject.)
FatherObjectID
 Gets or sets the identifier of the father part.
 (Inherited from AnalysisObject.)
FatherObjectType
 Gets or sets the type of the father object.
 (Inherited from AnalysisObject.)
ID
 Gets or sets the identifier of the analysis object.
 (Inherited from AnalysisObject.)
ModelLoadGroupID
 Gets or sets the identifier of the load group.
 (Inherited from AnalysisDecomposedLoad.)
ModelLoadID
 Gets or sets the identifier of the model load.
 (Inherited from AnalysisDecomposedLoad.)
ObjectAttachedToID
 Gets or sets the identifier of the object the load is attached to.
 (Inherited from AnalysisDecomposedLoad.)
ObjectAttachedToType
 Gets or sets the type of the object the load is attached to.
 (Inherited from AnalysisDecomposedLoad.)
Top
Methods
Name | Description
Select
 Selects an analysis decomposed selfweight load.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
Tekla.Structures.Analysis Namespace